<template id=""> <!-- Тут должна быть вёрстка -->
    <div class=""> <!--  Базовый див, всегда должен быть  -->


      <p>В любое место вёрстки можно вставить переменную вот так: {{per2}}</p>
      <p>Так можно запустить любую функцию из "methods" <button @click="methodName()">Кнопка</button></p>
      <p v-if="peremennaya1">А этот параграф не отобразится, потому, что v-if смотреть истинность переменной, и если она приведётся к истине - отобразит этот тег</p>
      <p v-else>А этот тег отобразится из-за того, что предыдущее условие v-if было ложно</p>
      <p>Можно написать метод, чтоб менять значение переменной <button @click="changePeremennaya()">Изменить</button> </p>
    </div>
</template>

<script>// Тут всё, что связано с JS
export default {
  ////////////////////////////////////////////////////////////////////
  data() {
    return{ /*Тут создаются "переменные".Перечисляются через запятую*/
      peremennaya1: false,
      per2: 'Hy poro9u'
    }
  },
  ////////////////////////////////////////////////////////////////////
  methods: { // Тут хранятся все методы (функции). Перечисляются через запятую
    methodName() {
      alert(this.per2);//так получаются переменные из data() (this.per2)
    },
    changePeremennaya() {
      this.peremennaya1 = !this.peremennaya1;
    }
  },
  ////////////////////////////////////////////////////////////////////
  mounted() { //эта функция запустится когда этот vue файл будет загружен

  }
}
</script>

<style> /* Тут только стили CSS */
html {
  background-color: grey;
}
</style>
